# PANDAS :

PANDAS:python data analysis library

>it is used for data visualazation

# video 1:

# How to Made Data Frame With Dictionaries and Libraries

Dictionaries

In [2]:
import pandas as pd

In [3]:
d ={'name':['kishore','bibishan','laxaman'],'age':[12,55,78]}

In [4]:
df = pd.DataFrame(data =d)

In [5]:
df.head()

       name  age
0   kishore   12
1  bibishan   55
2   laxaman   78

List:

In [6]:
l = [['kishore','kumar','ravi'],[12,3,4]]

In [7]:
df = pd.DataFrame(data=l)

In [8]:
df.head()

         0      1     2
0  kishore  kumar  ravi
1       12      3     4

In [11]:
df = pd.DataFrame(data=l,columns=['name','age','love'])

In [13]:
df.head().T

            0   1
name  kishore  12
age     kumar   3
love     ravi   4

In [1]:
import pandas as pd

In [2]:
d ={'name':['kishore','ram','love'],'age':[23,24,4]}

In [3]:
print(d)

{'name': ['kishore', 'ram', 'love'], 'age': [23, 24, 4]}

In [4]:
df =pd.DataFrame(data=d)

In [5]:
df.head()

      name  age
0  kishore   23
1      ram   24
2     love    4

In [17]:
l=[['kishore','lucky','ramu'],[21,32,43]]

In [18]:
print(l)

[['kishore', 'lucky', 'ramu'], [21, 32, 43]]

In [19]:
df=pd.DataFrame(data=l)

In [23]:
import numpy as np

In [26]:
l=np.array(l).T

In [27]:
df=pd.DataFrame(data=l,columns=['name','age'])

In [28]:
df.head()

      name age
0  kishore  21
1    lucky  32
2     ramu  43

In [29]:
df =pd.read_csv('train.csv')

In [30]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [31]:
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [32]:
df.tail(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [33]:
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [37]:
df[df['Survived']==1df['Age']<=15]

TypeError: Cannot perform 'rand_' with a dtyped [float64] array and scalar of type [bool]